In [1]:
import pandas as pd
import numpy as np

import pymysql
from sqlalchemy import create_engine

from sklearn.metrics import confusion_matrix, accuracy_score, precision_score, recall_score, ConfusionMatrixDisplay
from sklearn.metrics import classification_report, f1_score, cohen_kappa_score

import getpass  # To get the password without showing the input

In [2]:
password = getpass.getpass()

········

In [3]:
connection_string = 'mysql+pymysql://root:'+password+'@localhost/sakila'
engine = create_engine(connection_string)
data = pd.read_sql_query('SELECT * FROM film', engine)
data.head() #just checking

,film_id,title,description,release_year,language_id,original_language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features,last_update
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,None,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes",2006-02-15 05:03:42
1,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,2006,1,None,3,4.99,48,12.99,G,"Trailers,Deleted Scenes",2006-02-15 05:03:42
2,3,ADAPTATION HOLES,A Astounding Reflection of a Lumberjack And a ...,2006,1,None,7,2.99,50,18.99,NC-17,"Trailers,Deleted Scenes",2006-02-15 05:03:42
3,4,AFFAIR PREJUDICE,A Fanciful Documentary of a Frisbee And a Lumb...,2006,1,None,5,2.99,117,26.99,G,"Commentaries,Behind the Scenes",2006-02-15 05:03:42
4,5,AFRICAN EGG,A Fast-Paced Documentary of a Pastry Chef And ...,2006,1,None,6,2.99,130,22.99,G,Deleted Scenes,2006-02-15 05:03:42

In [5]:
# 1. How many distinct (different) actors' last names are there?

query1 = 'SELECT count(Distinct(last_name)) as "number of last names" FROM sakila.actor' 
data2 = pd.read_sql_query(query1, engine)
data2.head()

   number of last names
0                   121

In [33]:
# 2. Add an additional column day_type with values 'weekend' and 'workday' depending on the rental day of the week.

engine = create_engine(connection_string)
query2 = 'SELECT *, CASE WHEN date_format((rental_date), "%w") > 0 AND date_format((rental_date), "%w") < 6 \
THEN "workday" WHEN date_format((rental_date), "%w") = 0 \
THEN "weekend" WHEN date_format((rental_date), "%w") = 6 \
THEN "weekend" END AS day_type FROM sakila.rental'
data3 = pd.read_sql_query(query2, engine)
data3.head()


# not sure why is it not recognising my long query?

ValueError: unsupported format character 'w' (0x77) at index 49

In [40]:
# 3. Get all films with ARMAGEDDON in the title.

query3 = 'SELECT title FROM sakila.film WHERE title regexp "ARMAGEDDON"'
data4 = pd.read_sql_query(query3, engine)
data4.head(30)

                   title
0        ARMAGEDDON LOST
1    LADYBUGS ARMAGEDDON
2       METAL ARMAGEDDON
3    MOSQUITO ARMAGEDDON
4  STAGECOACH ARMAGEDDON
5      STEERS ARMAGEDDON

In [50]:
# 4. Get 10 the longest films.
query4 = 'SELECT length, title FROM sakila.film ORDER BY length DESC LIMIT 10'
data5 = pd.read_sql_query(query4, engine)
data5

   length               title
0     185      DARN FORRESTER
1     185        POND SEATTLE
2     185       CHICAGO NORTH
3     185       MUSCLE BRIGHT
4     185        WORST BANGER
5     185         GANGS PRIDE
6     185  SOLDIERS EVOLUTION
7     185           HOME PITY
8     185   SWEET BROTHERHOOD
9     185      CONTROL ANTHEM

In [49]:
# 5. How many films include Behind the Scenes content?

query5 = 'SELECT Count(special_features) as "films with BTS" FROM sakila.film WHERE special_features = "Behind the Scenes"'
data6 = pd.read_sql_query(query5, engine)
data6

   films with BTS
0              70

In [48]:
# 6. Which kind of movies (rating) have a mean duration of more than two hours?

query6 = 'SELECT ROUND(AVG(length),2) as length, rating FROM sakila.film GROUP BY rating HAVING length > 120'
data7 = pd.read_sql_query(query6, engine)
data7

   length rating
0  120.44  PG-13

In [47]:
# 7. Rank films by length (filter out the rows that have nulls or 0s in length column). 
# In your output, only select the columns title, length, and the rank

query7 = 'SELECT length, title, RANK() OVER(ORDER BY length desc) as "Ranking" FROM film'
data8 = pd.read_sql_query(query7, engine)
data8

     length                title  Ranking
0       185        CHICAGO NORTH        1
1       185       CONTROL ANTHEM        1
2       185       DARN FORRESTER        1
3       185          GANGS PRIDE        1
4       185            HOME PITY        1
..      ...                  ...      ...
995      46         ALIEN CENTER      996
996      46            IRON MOON      996
997      46        KWAI HOMEWARD      996
998      46     LABYRINTH LEAGUE      996
999      46  RIDGEMONT SUBMARINE      996

[1000 rows x 3 columns]